In [1]:
#label encoder

In [2]:
import pandas as pd
df = pd.DataFrame({
    'color': ['red','blue','green','green','red','blue']
})
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
lbl_encoder = LabelEncoder()

In [5]:
lbl_encoder.fit_transform(df[['color']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [7]:
lbl_encoder.transform([['red']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:134: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [8]:
#Ordinal Encoding

In [9]:
from sklearn.preprocessing import OrdinalEncoder

In [10]:
df = pd.DataFrame({
    'size':['s','m','l','m','s','l']
})
df

  size
0    s
1    m
2    l
3    m
4    s
5    l

In [11]:
#create an instance of OrdinalEncoder and fit_tronsform
encoder = OrdinalEncoder(categories=[['s','m','l']])

In [12]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [13]:
#Target Guided Ordinal Encoding

In [14]:
import pandas as pd

df = pd.DataFrame({
    'city': ['New York','London','Parsis','Tokyo','New York','Paris'],
    'price': [200,150,300,250,180,320]
})

In [17]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [18]:
mean_price

{'London': 150.0,
 'New York': 190.0,
 'Paris': 320.0,
 'Parsis': 300.0,
 'Tokyo': 250.0}

In [19]:
df['city_encoded']=df['city'].map(mean_price)

In [20]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2    Parsis    300         300.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         320.0

In [21]:
df[['city','city_encoded']]

       city  city_encoded
0  New York         190.0
1    London         150.0
2    Parsis         300.0
3     Tokyo         250.0
4  New York         190.0
5     Paris         320.0

In [22]:
#time in tips dataset convert to target guided ordinal encoding using total_bill

In [23]:
import seaborn as sns
tips = sns.load_dataset('tips')

In [24]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [26]:
encoder_time =  tips.groupby('time')['total_bill'].mean().to_dict()
encoder_time

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [27]:
tips['time_encoded'] = tips['time'].map(encoder_time)
tips

     total_bill   tip     sex smoker   day    time  size time_encoded
0         16.99  1.01  Female     No   Sun  Dinner     2    20.797159
1         10.34  1.66    Male     No   Sun  Dinner     3    20.797159
2         21.01  3.50    Male     No   Sun  Dinner     3    20.797159
3         23.68  3.31    Male     No   Sun  Dinner     2    20.797159
4         24.59  3.61  Female     No   Sun  Dinner     4    20.797159
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3    20.797159
240       27.18  2.00  Female    Yes   Sat  Dinner     2    20.797159
241       22.67  2.00    Male    Yes   Sat  Dinner     2    20.797159
242       17.82  1.75    Male     No   Sat  Dinner     2    20.797159
243       18.78  3.00  Female     No  Thur  Dinner     2    20.797159

[244 rows x 8 columns]